run/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionName      plateRegion;

phase           liquid;

viscosity
{
    model       Newtonian;
}

sigma       0.07;

deltaWet    1e-12;

hydrophilic no;

transfer
{
    VoFPatchTransfer
    {
        deltaFactorToVoF  1.5;
        alphaToVoF        0.9;

        deltaFactorToFilm 0.9;
        alphaToFilm       0.86;

        transferRateCoeff 0.1;
    }
}

momentumTransport
{
    model       laminar;
    Cf          0.001;
}

upperSurfaceModels
{
    heatTransfer
    {
        model    constant;
        c0       1;
    }
}

lowerSurfaceModels
{
    heatTransfer
    {
        model    constant;
        c0       1;
    }
}


// ************************************************************************* //
